
/*
	iiclib ,for GT3000 series, iic bus ctl --wsy Oct 2008

*/

#ifndef _IIC_LIB_H
#define _IIC_LIB_H
/**********************************************************************
*函数名	:open_iic_dev
*功能	:打开IIC设备
*输入	: 无
*返回值	:返回iic_fd, 负值表示失败
*修改日志:
**************************************************************************/
int open_iic_dev(void);



/************************************************************************
*函数名	:write_iic_reg
*功能	:写iic设备的寄存器
*输入	:  
	  unsigned char chip_addr //iic设备地址，形如0x8a for 9910
	  unsigned char reg;	//寄存器地址
* 	  int val;				//寄存器参数值
*返回值	:0表示成功，负值表示错误
*修改日志:
**************************************************************************/
int write_iic_reg(unsigned char chip_addr, unsigned char reg , unsigned char value);

/************************************************************************
*函数名	:read_iic_reg
*功能	:读取iic设备寄存器值
*输入	:  
	  unsigned char chip_addr //iic设备地址，形如0x8a for 9910
	  unsigned char reg;			//寄存器的地址
	  unsigned char *val;		//存放寄存器值的指针
*返回值	:成功返回 0 寄存器的值存放在val中，失败返回-1
*修改日志:
*************************************************************************/
int read_iic_reg(int chip_addr, unsigned char reg, unsigned char *val);



/*************************************************************************
*函数名	:enable_iic_bus
*功能	:恢复iic总线正常工作
*输入	: 无
*返回值	:0表示正常，负值表示异常
*修改日志:
*************************************************************************/
int enable_iic_bus(void);


/***********************************************************************
*函数名	:disable_iic_bus
*功能	:禁止iic总线工作
*输入	: 无
*返回值	:0表示正常，负值表示异常
*修改日志:
**************************************************************************/
int disable_iic_bus(void);

#endif

