#ifndef __IO_TEST_H
#define __IO_TEST_H


#define GTVS_SYS_FILE		("/conf/gt1000.ini")

/**********************************************************************************************
* 函数名   :test_io_mod()
* 功能  :       测试io模块
* 输入  :       void
* 输出  :       void        
* 返回值:   0正确，负值错误码
**********************************************************************************************/
int test_io_mod(void);


/**********************************************************************************************
* 函数名   :set_trigin_mode()
* 功能  :      修改输入端子为常开或常闭状态
* 输入  :      set_trigin_mode	:0-->常开
*							:1-->常闭
*				ch_en		:设置4分割画面
* 输出  :       void        
* 返回值:   0正确，负值错误码
**********************************************************************************************/
int  set_trigin_mode(int trig_mode,int ch_en);

#endif

