#ifndef GATE_CONNECT_H
#define GATE_CONNECT_H
#include <pthread.h>
#include "mod_socket.h"
#define	MAX_GATE_LIST				6		//gatelist中存放的最大服务器列表数

struct gate_struct{
//GT1000系统中对网关的描述(由GT1000主动发起连接)
	pthread_mutex_t mutex;	//访问结构要用到的锁
	int	fd;					//建立连接的描述符 -1表示还没有建立连接
	int	period;				/*有效期，当建立连接后这个值被赋予一个初始值
							    之后每秒都减1，直到0断开连接，如果有程序发送了一条命令
							    则这个数值恢复到初始值*/
	struct sockaddr_in gateaddr;//远程网关地址及端口
};

typedef struct{
int dev_no;
struct gate_struct *gate;
}dev_gate_struct;
/**********************************************************************************************
 * 函数名	:get_gate_list()
 * 功能	:获取一个描述网关结构数组的指针
 * 输入	:无
 * 返回值	:描述网关结构数组的指针，数组元素的个数为MAX_GATE_LIST
 **********************************************************************************************/
struct gate_struct *get_gate_list(int dev_no);


/**********************************************************************************************
 * 函数名	:send_gate_pkt()
 * 功能	:将填充好的数据包委托发送线程发送给网关
 * 输入	:fd:网络连接描述符,-1表示由发送线程建立一个主动连接
 *									   -2表示如果网关服务器都连接不通则连接紧急报警服务器
 *			len:要发送的数据长度(mod_com_type结构中包括cmd及以下字段的长度)
 *			send:填充好数据的结构指针,包括env,enc应该也填充好
 * 返回值	:描述网关结构数组的指针，数组元素的个数为MAX_GATE_LIST
 * 注		:各线程要想发送数据给远程网关则调用此接口统一发送
 *			 调用者需要把要发送给远程网关服务器的数据包全部填充在 mod_com_type结构中的para字段里面
 **********************************************************************************************/

int send_gate_pkt(int fd,struct mod_com_type *send,int len,int dev_no);

/**********************************************************************************************
 * 函数名	:creat_connect_thread()
 * 功能	:创建一个连接并发送命令 给网关的线程
 * 输入	:attr:创建线程的属性
 *			 
 * 返回值	:0表示成功，负值表示失败
 **********************************************************************************************/
int creat_connect_thread(pthread_attr_t *attr);

/**********************************************************************************************
 * 函数名	:gate_connect_second_proc()
 * 功能	:网关连接线程的秒处理函数
 * 输入	:无	 
 * 返回值	:无
 **********************************************************************************************/
void gate_connect_second_proc(int count,int chn);

/**********************************************************************************************
 * 函数名	:set_gate_ip()
 * 功能	:将一个ip地址设置到网关ip地址列表中
 * 输入	:place:要设置的网关序号
 *			 ip:服务器ip地址（ip3,ip2,ip1,ip0）
 *			 port:服务器提供服务的端口号
 * 返回值	:0表示成功负值表示失败
 **********************************************************************************************/
int set_gate_ip(int dev_no,int place,DWORD *ip,WORD port);


int create_recv_gate_ack_thread(dev_gate_struct *devgate);
#endif
