#ifndef HDMOD_API_H
#define HDMOD_API_H
#include "gate_cmd.h"
#include "mod_socket.h"



/*****************************************************************************
 *函数名: alarm_snapshot()
 *功能:   让hdmodule模块进行报警抓图
 *输入:   takepic,为takepic_struct结构,包括时间戳,张数，间隔，通道
 *返回值: 0表示成功，负值表示失败
 ****************************************************************************/
int alarm_snapshot(struct takepic_struct *takepic,WORD env,WORD enc);

/**********************************************************************************************
 * 函数名	:refresh_hdmodule_para()
 * 功能	:让hdmodule重新读取配置
 * 输入	:无	 
 * 返回值	:0表示成功，负值表示失败
 **********************************************************************************************/
int refresh_hdmodule_para(void);

/**********************************************************************************************
 * 函数名	:restart_hd_record()
 * 功能	:重新启动指定通道的高清晰录像
 * 输入	:ch:要重新启动的高清析录像通道号
 * 返回值	:0表示成功，负值表示失败
 **********************************************************************************************/
int restart_hd_record(int ch);
 
 /**********************************************************************************************
 * 函数名	:start_hd_record()
 * 功能	:启动指定通道的高清晰录像
 * 输入	:ch:要启动的高清析录像通道号
 * 返回值	:0表示成功，负值表示失败
 **********************************************************************************************/
int start_hd_record(int ch);
 
/**********************************************************************************************
 * 函数名	:stop_hd_record()
 * 功能	:停止指定通道的高清晰录像
 * 输入	:ch:要停止的高清析录像通道号
 * 返回值	:0表示成功，负值表示失败
 **********************************************************************************************/
int stop_hd_record(int ch);

/**********************************************************************************************
 * 函数名	:trig_record_event()
 * 功能	:触发一次录像事件
 * 输入	:ch录像通道
 *			 trig:触发事件(录像原因)
 *			reclen:希望进行多长时间的录像(实际录像时还会加上延时录像),传0即可
 * 返回值	:0表示成功，负值表示失败
 **********************************************************************************************/
int trig_record_event(int ch,int trig,int reclen);


/**********************************************************************************************
 * 函数名	:remote_cancel_alarm()
 * 功能	:处理远程发来的解除警报指令
 * 输入	:trig:按位表示的触发状态，做复位报警联动用
 * 返回值	:0表示成功，负值表示失败
 **********************************************************************************************/
int remote_cancel_alarm(DWORD trig);

/**********************************************************************************************
 * 函数名	:clear_hdmod_trig_flag()
 * 功能	:清除高清晰录像模块的触发状态
 * 输入	:无
 * 返回值	:0表示成功，负值表示失败
 **********************************************************************************************/
int clear_hdmod_trig_flag(DWORD trig);






/*********************************************************************************************
*函数名	:	alarm_stop_playback()
*功能		:	发送停止录像回放命令给videoenc
*输入		:	无
*返回值	:	0表示成功，负值表示失败
**********************************************************************************************/
int alarm_cancel_playback(void);

/*********************************************************************************************
*函数名	:	alarm_cancel_playback_rtimg()
*功能		:	发送停止录像回放命令给tcprtimg
*输入		:	ch 切换回的通道号
*返回值	:	0表示成功，负值表示失败
*备注		:	此函数将发送停止录像回放命令给tcprtimg模块
**********************************************************************************************/
int alarm_cancel_playback_rtimg(int ch);


/*********************************************************************************************
*函数名	:	alarm_enc_playback()
*功能		:	发送录像回放命令给videoenc
*输入		:	ch  回放的视频输入通道
*返回值	:	0表示成功，负值表示失败
**********************************************************************************************/
int alarm_enc_playback(int ch);

/*********************************************************************************************
*函数名	:	alarm_playback()
*功能		:	发送录像回放命令给tcprtimg
*输入		:	ch 回放的视频输入通道
*返回值	:	0表示成功，负值表示失败
**********************************************************************************************/
int alarm_playback(int ch);

/*********************************************************************************************
*函数名	:	alarm_hd_playback()
*功能		:	发送录像回放命令给hdmodule
*输入		:	none
*返回值	:	0表示成功，负值表示失败
**********************************************************************************************/
int alarm_hd_playback(void);

#endif
