#ifndef WATCH_BOARD_H
#define WATCH_BOARD_H

#include "gate_cmd.h"
#include "mod_socket.h"

/**********************************************************************************************
 * 函数名	:watch_board_second_proc()
 * 功能	:定期喂狗的秒处理函数
 * 输入	:无
 * 返回值	:无
 **********************************************************************************************/
void watch_board_second_proc(void);

/**********************************************************************************************
 * 函数名	:creat_watch_board_thread()
 * 功能	:创建监视端子输入的线程
 * 输入	:attr:线程属性
 * 返回值	:0表示成功，负值表示失败
 **********************************************************************************************/
int creat_watch_board_thread(pthread_attr_t *attr);


/**********************************************************************************************
 * 函数名	:get_dev_trig()
 * 功能	:取当前时间和触发状态，填充dev_trig结构
 * 输入	:
 * 输出	:dev_trig:描述设备报警信息的结构指针，返回时填充
 * 返回值	:0表示成功，负值表示失败
 **********************************************************************************************/
int get_dev_trig(int dev_no,struct send_dev_trig_state_struct *dev_trig);

int init_ipalarm_fd();

#endif
