#ifndef __GTIFSTAT_H
#define __GTIFSTAT_H

/*********************************************************
 *函数名:init_gtifstat();
 *功能:	 初始化
 *返回值:正确返回0，错误返回负数
 *备注:	无
 * ********************************************************/
int init_gtifstat(void);


/**********************************************************
 *函数名:get_send_pkts();
 *功能:获取指定接口的发送出去的数据包个数
 *返回值:发送出去的数据包的个数
 *备注:到当前为止，发送出去的数据包的个数
 **********************************************************/
unsigned long get_send_pkts(void);


/**********************************************************
 *函数名:get_recv_pkts();
 *功能:获取指定接口的接收到的数据包个数
 *返回值:接收到的数据包的个数
 *备注:到当前为止，接收到的数据包的个数
 **********************************************************/
unsigned long get_recv_pkts(void);


/*********************************************************
 *函数名:init_gtifstat();
 *功能:	 初始化
 *返回值:正确返回0，错误返回负数
 *备注:	无
 * ********************************************************/
int close_gtifstat(void);
#endif
