#ifndef TW9903API_H
#define TW9903API_H
#define SCR_MODE_D1	0
#define	SCR_MODE_HD1	1
#define SCR_MODE_CIF	2
#define SCR_MODE_QCIF	3
///////////////////////
#define TW9903_ADDR	0x44	//9903 设备地址
#define EEPROM_ADDR	0x50	//test eeprom 
//iic_fd:已经打开的i2c总线设备的描述符
//chip_addr:iic总线上芯片的地址
//mode:想要9903输出的视频格式 SCR_MODE_D1,SCR_MODE_HD1,SCR_MODE_CIF,SCR_MODE_QCIF,其中SCR_MODE_D1和SCR_MODE_HD1的配置表一样

/*
************************************************************************
*函数名	:init_iic_dev
*功能	:初始化IIC设备
*输入	:  无
*返回值	:成功返回设备控制字, 负值表示失败
*修改日志:
*************************************************************************
*/
int init_iic_dev(void);
/*
************************************************************************
*函数名	:release_iic_dev
*功能	:关闭/释放IIC设备
*输入	:  无
*返回值	:成功返回0, 负值表示失败
*修改日志:
*************************************************************************
*/
int release_iic_dev(int iic_fd);
/*
************************************************************************
*函数名	:write_tw9903_reg
*功能	:写tw9903设备的寄存器
*输入	:  
	  int iic_fd;			//打开设备返回的控制句柄	
	  int chip_addr;		//设备地址
	  unsigned char reg;	//寄存器地址
* 	  int val;				//寄存器参数值
*返回值	:0表示成功, 负值表示失败
*修改日志:
*************************************************************************
*/
int write_tw9903_reg(int iic_fd, int chip_addr, unsigned char reg , int value);
/*
************************************************************************
*函数名	:read_tw9903_reg
*功能	:读取tw9903 寄存器值
*输入	:  
	  int iic_fd;		//打开设备返回的控制句柄	
	  int chip_addr;	//设备地址
	  int reg;			//寄存器的地址
*返回值	:成功返回寄存器的值，失败返回0xff
*修改日志:
*************************************************************************
*/
unsigned char read_tw9903_reg(int iic_fd, int chip_addr,unsigned char reg);
/*
************************************************************************
*函数名	:init_tw9903
*功能	:tw9903 初始化
*输入	:  
	  int iic_fd;		//打开设备返回的控制句柄	
	  int chip_addr;	//设备地址
* 	  int mode;		//工作模式
//mode:想要9903输出的视频格式 SCR_MODE_D1,SCR_MODE_HD1,SCR_MODE_CIF,SCR_MODE_QCIF,其中SCR_MODE_D1和SCR_MODE_HD1的配置表一样

*返回值	:0表示成功，负值表示失败
*修改日志:
*************************************************************************
*/
int init_tw9903(int iic_fd,int chip_addr,int mode);
/*
************************************************************************
*函数名	:read_tw9903_vloss
*功能	:读取9903视频丢失状态
*输入	:  
	  int iic_fd;		//打开设备返回的控制句柄	
	  int chip_addr;	//设备地址
* 	  
*返回值	:0表示没有遮挡，1 表示有遮挡，负值表示失败
*修改日志:
*************************************************************************
*/
int read_tw9903_vloss(int iic_fd,int chip_addr);
/*
************************************************************************
*函数名	:set_tw9903_brightness
*功能	:设置tw9903 亮度
*输入	:  
	  int iic_fd;		//打开设备返回的控制句柄	
	  int chip_addr;	//设备地址
* 	  int val;			//亮度参数值,范围为0-100
*返回值	:0表示成功负值表示失败
*修改日志:
*************************************************************************
*/
int set_tw9903_brightness(int iic_fd,int chip_addr,int val);
/*
************************************************************************
*函数名	:set_tw9903_hue
*功能	:设置tw9903 色度
*输入	:  
	  int iic_fd;		//打开设备返回的控制句柄	
	  int chip_addr;	//设备地址
* 	  int val;			//色度参数值,范围为0-100
*返回值	:0表示成功负值表示失败
*修改日志:
*************************************************************************
*/
int set_tw9903_hue(int iic_fd,int chip_addr,int val);
/*
************************************************************************
*函数名	:set_tw9903_contrast
*功能	:设置tw9903 对比度
*输入	:  
	  int iic_fd;		//打开设备返回的控制句柄	
	  int chip_addr;	//设备地址
* 	  int val;			//对比度参数值，,范围为0-100
*返回值	:0表示成功负值表示失败
*修改日志:
*************************************************************************
*/
int set_tw9903_contrast(int iic_fd,int chip_addr,int val);
/*
************************************************************************
*函数名	:set_tw9903_saturation
*功能	:设置tw9903 饱和度
*输入	:  
	  int iic_fd;		//打开设备返回的控制句柄	
	  int chip_addr;	//设备地址
* 	  int val;			//饱和度参数值,范围为0-100
*返回值	:0表示成功负值表示失败
*修改日志:
*************************************************************************
*/
int set_tw9903_saturation(int iic_fd,int chip_addr,int val);
/*
************************************************************************
*函数名	:set_tw9903_sharp2
*功能	:设置锐化寄存器1
*输入	:  
	  int iic_fd;		//打开设备返回的控制句柄	
	  int chip_addr;	//设备地址
* 	  int val;			//锐化寄存器1的参数值
*返回值	:0表示成功负值表示失败
*修改日志:
*************************************************************************
*/
int set_tw9903_sharp1(int iic_fd,int chip_addr,int val);
/*
************************************************************************
*函数名	:set_tw9903_sharp2
*功能	:设置锐化寄存器2
*输入	:  
	  int iic_fd;		//打开设备返回的控制句柄	
	  int chip_addr;	//设备地址
* 	  int val;			//锐化寄存器2的参数值
*返回值	:0表示成功负值表示失败
*修改日志:
*************************************************************************
*/
int set_tw9903_sharp2(int iic_fd,int chip_addr,int val);
/*
************************************************************************
*函数名	:set_tw9903_H_range
*功能	:设置H_DELAY寄存器
*输入	:  
	  int iic_fd;		//打开设备返回的控制句柄	
	  int chip_addr;	//设备地址
* 	  int val;			//H_DELAY寄存器的参数值 
					//参数范围: 0x80 - 0x83  default: 0x81
*返回值	:0表示成功负值表示失败
*修改日志:
*************************************************************************
*/
int set_tw9903_H_range(int iic_fd,int chip_addr,int val);

#endif
